A Curtain System cannot be based on faces from multiple elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MultipleIdsInCurtainSystem { get; }
  Visual Basic
Public Shared ReadOnly Property MultipleIdsInCurtainSystem As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MultipleIdsInCurtainSystem {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace